## 📝 Terraform Plan Result:

```hcl
Acquiring state lock. This may take a few moments...
module.storage.random_integer.random: Refreshing state... [id=548]
module.storage.data.azurerm_client_config.current: Reading...
module.storage.azurerm_resource_group.key_vault_rg: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg]
module.network.azurerm_resource_group.network_rg: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg]
module.k8s.azurerm_resource_group.jumphost_rg: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg]
azurerm_resource_group.AKS_Cluster_RG: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg]
module.storage.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9N2I1OTgxODMtMjk1Ny00OTc1LTliNzMtYTc4MGFhZWUxOWY3O3N1YnNjcmlwdGlvbklkPWJjOTNmMDVjLTAyMmEtNGUyYi04NjIzLTcxM2VkNjEyZTFlOTt0ZW5hbnRJZD1jN2EwMmIyOC00MzU1LTRlZmEtODQzYi0yNDMxNjZhNWFiM2U=]
module.storage.azurerm_key_vault.akv: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg/providers/Microsoft.KeyVault/vaults/azkeyvault548]
module.k8s.azurerm_public_ip.bastion_pip: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg/providers/Microsoft.Network/publicIPAddresses/bastionpip]
module.k8s.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerRegistry/registries/szymonctainerregistry01]
module.network.azurerm_public_ip.natgw_pip: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/nat-gateway-pip]
module.network.azurerm_nat_gateway.natgw: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/natGateways/aks-nat-gateway]
module.network.azurerm_public_ip.appgw_pip: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/app-gateway-pip]
module.network.azurerm_private_dns_zone.acr_dns: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io]
module.network.azurerm_nat_gateway_public_ip_association.natgw_pip_association: Refreshing state... [id=/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/natGateways/aks-nat-gateway|/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/nat-gateway-pip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.k8s.azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + kerberos_enabled       = false
      + location               = "northeurope"
      + name                   = "bastion-host"
      + resource_group_name    = "jumphost-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/jumphost-rg/providers/Microsoft.Network/publicIPAddresses/bastionpip"
          + subnet_id            = (known after apply)
        }
    }

  # module.k8s.azurerm_kubernetes_cluster.aks_cluster will be created
  + resource "azurerm_kubernetes_cluster" "aks_cluster" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "szymon-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "aks-szymon-cluster"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = "System"
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "aks-cluster-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip     = "10.0.4.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "userAssignedNATGateway"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.0.4.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.k8s.azurerm_private_dns_a_record.acr_record will be created
  + resource "azurerm_private_dns_a_record" "acr_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "szymonctainerregistry01"
      + records             = (known after apply)
      + resource_group_name = "network-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.azurecr.io"
    }

  # module.k8s.azurerm_private_endpoint.acr_pe will be created
  + resource "azurerm_private_endpoint" "acr_pe" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "szymonctainerregistry01-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "aks-cluster-rg"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "szymonctainerregistry01-connection"
          + private_connection_resource_id = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerRegistry/registries/szymonctainerregistry01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.k8s.azurerm_role_assignment.aks_acr_assignment will be created
  + resource "azurerm_role_assignment" "aks_acr_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/aks-cluster-rg/providers/Microsoft.ContainerRegistry/registries/szymonctainerregistry01"
      + skip_service_principal_aad_check = true
    }

  # module.network.azurerm_application_gateway.appgw will be created
  + resource "azurerm_application_gateway" "appgw" {
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "aks-app-gateway"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "network-rg"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "vnet-10.0.0.0_23-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vnet-10.0.0.0_23-be-htst"
          + path                                = "/path1/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "vnet-10.0.0.0_23-feip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/publicIPAddresses/app-gateway-pip"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "vnet-10.0.0.0_23-feport"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "ip-config"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "vnet-10.0.0.0_23-feip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "vnet-10.0.0.0_23-feport"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vnet-10.0.0.0_23-httplstn"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "vnet-10.0.0.0_23-beap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "vnet-10.0.0.0_23-be-htst"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "vnet-10.0.0.0_23-httplstn"
          + id                          = (known after apply)
          + name                        = "vnet-10.0.0.0_23-rqrt"
          + priority                    = 9
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }

      + ssl_policy (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.acr_dns_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr_dns_link" {
      + id                    = (known after apply)
      + name                  = "acr-vnet-link"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "network-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_subnet_nat_gateway_association.natgw_subnet_association will be created
  + resource "azurerm_subnet_nat_gateway_association" "natgw_subnet_association" {
      + id             = (known after apply)
      + nat_gateway_id = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/network-rg/providers/Microsoft.Network/natGateways/aks-nat-gateway"
      + subnet_id      = (known after apply)
    }

  # module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/23",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "vnet-10.0.0.0_23"
      + resource_group_name = "network-rg"
      + subnet              = [
          + {
              + address_prefixes                              = [
                  + "10.0.0.0/24",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "aks-subnet-10.0.0.0_24"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
          + {
              + address_prefixes                              = [
                  + "10.0.1.0/28",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "appgw-subnet-10.0.1.0_28"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
          + {
              + address_prefixes                              = [
                  + "10.0.1.16/29",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "privendpoint-subnet-10.0.1.16_29"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
          + {
              + address_prefixes                              = [
                  + "10.0.1.32/27",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "AzureBastionSubnet"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
          + {
              + address_prefixes                              = [
                  + "10.0.1.64/29",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "jumphost-subnet-10.0.1.48_29"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
        ]
    }

  # module.storage.azurerm_key_vault.akv will be updated in-place
  ~ resource "azurerm_key_vault" "akv" {
      ~ access_policy                   = [
          ~ {
              ~ secret_permissions      = [
                  + "Get",
                ]
              ~ storage_permissions     = [
                  + "Get",
                ]
                # (5 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg/providers/Microsoft.KeyVault/vaults/azkeyvault548"
        name                            = "azkeyvault548"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage.azurerm_key_vault_secret.jumphost01_ssh_key will be created
  + resource "azurerm_key_vault_secret" "jumphost01_ssh_key" {
      + content_type            = "text/plain"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bc93f05c-022a-4e2b-8623-713ed612e1e9/resourceGroups/storage-rg/providers/Microsoft.KeyVault/vaults/azkeyvault548"
      + name                    = "jumphost01-ssh-pubkey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 10 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```